Tekla Open API Reference for Tekla Structures 2025
ComponentItem.ComponentTypeEnum Enumeration
 Defines the different component types.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ComponentTypeEnum
Public Enumeration ComponentTypeEnum
Members
Member name | Value | Description
UNKNOWN | 0 |  The unknown component type.
CONNECTION | 24 |  The component type is connection.
COMPONENT | 25 |  The component type is component.
SEAM | 26 |  The component type is seam.
DETAIL | 27 |  The component type is detail.
CUSTOM_PART | 43 |  The component type is custom part object.
DRAWING_PLUGIN | 38 |  The component type is drawing plugin.
See Also
Reference
Tekla.Structures.Catalogs Namespace